Tekla Open API Reference for Tekla Structures 2025
ModifiedObjectInfo Structure
Modification info returned by History.
 Namespace: Tekla.Structures.Model.History
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public struct ModifiedObjectInfo
<SerializableAttribute>
Public Structure ModifiedObjectInfo
The ModifiedObjectInfo type exposes the following members.
Fields
Name | Description
IsAttributeChanged
 Whether the object attribute (UDA) has changed.
IsCreated
Whether the object was created
IsModified
 Whether the object's has changed in a way that affects its numbering. This can include some UDA change.
IsNumberingChanged
 Whether the numbering of object has changed.
ModelObject
 Gets the object modified.
Top
See Also
Reference
Tekla.Structures.Model.History Namespace